Project/Toir/src/Documents/торо_ОстановочныеРемонты/торо_ОстановочныеРемонты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>торо_ОстановочныеРемонты</name>
  <basedOn>Document.торо_ПланГрафикРемонта</basedOn>
  <basedOn>Document.торо_ЗаявкаНаРемонт</basedOn>
  <basedOn>Document.торо_ОстановочныеРемонты</basedOn>
  <registerRecords>InformationRegister.торо_ОстановочныеРемонты</registerRecords>
  <registerRecords>InformationRegister.торо_ЗаявкиПоРемонтам</registerRecords>
  <registerRecords>InformationRegister.торо_СоответствиеКорректировокДокументамППР</registerRecords>
  <registerRecords>InformationRegister.торо_ПлановыеРемонтныеРаботы</registerRecords>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.торо_ПланГрафикРемонта</types>
      <types>DocumentRef.торо_ЗаявкаНаРемонт</types>
    </type>
  </attributes>
  <attributes>
    <name>IDОсновногоРемонта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидРемонта</name>
    <type>
      <types>CatalogRef.торо_ВидыРемонтов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаРемонта</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияРемонта</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.торо_ВидыОперацийДокументаОстановочныйРемонт</types>
    </type>
  </attributes>
  <attributes>
    <name>КорректируемыйДокумент</name>
    <type>
      <types>DocumentRef.торо_ОстановочныеРемонты</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаРемонтаСт</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияРемонтаСт</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусДокумента</name>
    <type>
      <types>CatalogRef.торо_СтатусыСогласованияДокументовРемонтныхРабот</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособСогласования</name>
    <type>
      <types>CatalogRef.торо_СпособыСогласованияДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_Сводный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СвязанныеРемонты</name>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектРемонта</name>
      <type>
        <types>CatalogRef.торо_ОбъектыРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидРемонта</name>
      <type>
        <types>CatalogRef.торо_ВидыРемонтов</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачалаРемонта</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончанияРемонта</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачалаРемонтаСтарая</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончанияРемонтаСтарая</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Отвязать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументИсточник</name>
      <type>
        <types>DocumentRef.торо_ПланГрафикРемонта</types>
        <types>DocumentRef.торо_ЗаявкаНаРемонт</types>
      </type>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>СпособВыполнения</name>
      <type>
        <types>EnumRef.СпособыСтроительства</types>
      </type>
    </attributes>
    <attributes>
      <name>КритичностьДефекта</name>
      <type>
        <types>CatalogRef.торо_КритичностьДефекта</types>
      </type>
    </attributes>
    <attributes>
      <name>гкс_ОписаниеРемонта</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>гкс_Статус</name>
      <type>
        <types>CatalogRef.торо_СтатусыСогласованияДокументовРемонтныхРабот</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИсторияСтатусов</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаКого</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусДокумента</name>
      <type>
        <types>CatalogRef.торо_СтатусыСогласованияДокументовРемонтныхРабот</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Согласующие</name>
    <attributes>
      <name>Согласующий</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Согласовано</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроведениеДокумента</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Порядок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусДокумента</name>
      <type>
        <types>CatalogRef.торо_СтатусыСогласованияДокументовРемонтныхРабот</types>
      </type>
    </attributes>
    <attributes>
      <name>Замещающий</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Project/Toir/src/InformationRegisters/торо_СоответствиеКорректировокДокументамППР/торо_СоответствиеКорректировокДокументамППР.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_СоответствиеКорректировокДокументамППР</name>
  <writeMode>RecorderSubordinate</writeMode>
  <dimensions>
    <name>Корректировка</name>
    <type>
      <types>DocumentRef.торо_ПланГрафикРемонта</types>
      <types>DocumentRef.торо_ГрафикРегламентныхМероприятийТОиР</types>
      <types>DocumentRef.торо_ОстановочныеРемонты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Корректируемый</name>
    <type>
      <types>DocumentRef.торо_ПланГрафикРемонта</types>
      <types>DocumentRef.торо_ГрафикРегламентныхМероприятийТОиР</types>
      <types>DocumentRef.торо_ОстановочныеРемонты</types>
      <types>DocumentRef.торо_ЗаявкаНаРемонт</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_Ремонты/торо_Ремонты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_Ремонты</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ДатаНачалаПлан</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончанияПлан</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаНачалаФакт</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончанияФакт</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>СпособВыполнения</name>
    <type>
      <types>EnumRef.СпособыСтроительства</types>
    </type>
  </resources>
  <resources>
    <name>ГарантийныйРемонт</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КрайняяДопустимаяДатаЗавершенияРемонта</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
      <types>CatalogRef.торо_СписокОбъектовРегламентногоМероприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидРемонта</name>
    <type>
      <types>CatalogRef.торо_ВидыРемонтов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_ОстановочныеРемонты/торо_ОстановочныеРемонты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ОстановочныеРемонты</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Отвязан</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДатаНачалаРемонта</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончанияРемонта</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>IDОсновного</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>IDЗависимого</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Удалить_ID_Корректировок</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_ПлановыеРемонтныеРаботы/торо_ПлановыеРемонтныеРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ПлановыеРемонтныеРаботы</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ДатаНачалаРемонтныхРабот</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончанияРемонтныхРабот</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <resources>
    <name>СпособВыполнения</name>
    <type>
      <types>EnumRef.СпособыСтроительства</types>
    </type>
  </resources>
  <resources>
    <name>Отменен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ID_базы_расчета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Замещен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ID_замещающего</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаНачалаРасчетная</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>СтоимостьРемонта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </resources>
  <dimensions>
    <name>ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектРемонтныхРабот</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидРемонтныхРабот</name>
    <type>
      <types>CatalogRef.торо_ВидыРемонтов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УдалитьПериодичностьДетализации</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УдалитьПодразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Удалить_ID_Корректировок</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/Enums/торо_ВидыОперацийДокументаОстановочныйРемонт/торо_ВидыОперацийДокументаОстановочныйРемонт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>торо_ВидыОперацийДокументаОстановочныйРемонт</name>
  <enumValues>
    <name>Корректировка</name>
  </enumValues>
  <enumValues>
    <name>ОстановочныйРемонт</name>
  </enumValues>
</mdclass:Enum>

Project/Toir/src/Documents/торо_ОстановочныеРемонты/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
Перем БезусловнаяЗапись Экспорт; // Отключает проверки при записи документа
перем СтруктураДанных Экспорт;  // Структура, хранящая данные для работы с уведомлениями.

#Область ОбработчикиСобытий
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Отказ = Ложь;
	торо_ЗаполнениеДокументов.ПроверитьВозможностьВводаНаОсновании(ДанныеЗаполнения, Отказ, Ложь);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	торо_ЗаполнениеДокументов20.ЗаполнитьШапкуДокумента(ДанныеЗаполнения, ЭтотОбъект);	
	
	Если ДанныеЗаполнения <> Неопределено Тогда
		Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.торо_ОстановочныеРемонты") Тогда
			
			ВидОперации = Перечисления.торо_ВидыОперацийДокументаОстановочныйРемонт.Корректировка;
			КорректируемыйДокумент = ДанныеЗаполнения;
			ДокументОснование = ДанныеЗаполнения.ДокументОснование;
			IDОсновногоРемонта = ДанныеЗаполнения.IDОсновногоРемонта;
			ОбъектРемонта = ДанныеЗаполнения.ОбъектРемонта;
			ВидРемонта = ДанныеЗаполнения.ВидРемонта;
			ДатаНачалаРемонта = ДанныеЗаполнения.ДатаНачалаРемонта;
			ДатаОкончанияРемонта = ДанныеЗаполнения.ДатаОкончанияРемонта;
			ДатаНачалаРемонтаСт = ДанныеЗаполнения.ДатаНачалаРемонта;
			ДатаОкончанияРемонтаСт = ДанныеЗаполнения.ДатаОкончанияРемонта;
					
			Для Каждого Строка Из ДанныеЗаполнения.СвязанныеРемонты Цикл
				Если Не Строка.Отвязать Тогда
					НС = СвязанныеРемонты.Добавить();
					ЗаполнитьЗначенияСвойств(НС, Строка, ,"ДатаНачалаРемонтаСтарая, ДатаОкончанияРемонтаСтарая");
					НС.ДатаНачалаРемонтаСтарая = Строка.ДатаНачалаРемонта;
					НС.ДатаОкончанияРемонтаСтарая = Строка.ДатаОкончанияРемонта;
				КонецЕсли;
			КонецЦикла;
		Иначе
			ВидОперации = Перечисления.торо_ВидыОперацийДокументаОстановочныйРемонт.ОстановочныйРемонт;
			ДокументОснование = ДанныеЗаполнения;
			
			ИмяТЧ = торо_Ремонты.ПолучитьИмяТЧРемонтов(ДанныеЗаполнения);
			Неотмененный = торо_ЗаполнениеДокументов.ВернутьIDНеотмененногоРемонтаВРегламентныхМероприятиях(ДанныеЗаполнения, ДанныеЗаполнения[ИмяТЧ]);
				
			Если ИмяТЧ <> Неопределено И Неотмененный <> ""  Тогда
					
				СоответствиеИДДокументам = Новый Соответствие;
				СоответствиеИДДокументам.Вставить(Неотмененный, ДанныеЗаполнения);   
				торо_ЗаполнениеДокументов20.ЗаполнитьДокументНаОсновании(СоответствиеИДДокументам, ЭтотОбъект);
					
			КонецЕсли;			
				
		КонецЕсли;
	Иначе
		ВидОперации = Перечисления.торо_ВидыОперацийДокументаОстановочныйРемонт.ОстановочныйРемонт;
	КонецЕсли;
	
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение или РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		ПроверитьСуществованиеСледующихДокументов(Отказ);
	КонецЕсли;
	
	ТекстЗапроса = "ВЫБРАТЬ
	|	торо_СоответствиеКорректировокДокументамППР.Корректировка
	|ИЗ
	|	РегистрСведений.торо_СоответствиеКорректировокДокументамППР КАК торо_СоответствиеКорректировокДокументамППР
	|ГДЕ
	|	торо_СоответствиеКорректировокДокументамППР.Корректируемый = &Корректируемый";
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Корректируемый", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() > 0 Тогда
		ТекстСообщения = НСтр("es='¡En razon del documento son introducidas las correcciones!';ru='На основании документа введены корректировки!';en='Based on the document, adjustments are made!'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
	КонецЕсли;
			
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	Если ВидОперации <> Перечисления.торо_ВидыОперацийДокументаОстановочныйРемонт.Корректировка Тогда
		МассивНепроверяемыхРеквизитов.Добавить("КорректируемыйДокумент");
	КонецЕсли;
	
	Если ДатаНачалаРемонта > ДатаОкончанияРемонта Тогда
		ТекстСообщения = НСтр("es='¡La fecha del comienzo de la reparación de parada es más grande que la fecha de la terminación!';ru='Дата начала остановочного ремонта больше даты окончания!';en='The start date of the overhaul is longer than the end date!'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
	КонецЕсли;
	
	// Проверим чтобы ни один ремонт в таблице зависимых не выходил за пределы даты начала и окончания основного.
	Для Каждого Зависимый Из СвязанныеРемонты Цикл
		
		Если НЕ ЗначениеЗаполнено(Зависимый.ДатаНачалаРемонта) ИЛИ НЕ ЗначениеЗаполнено(Зависимый.ДатаОкончанияРемонта) Тогда
			Продолжить;
		КонецЕсли;
		
		Если Зависимый.ДатаНачалаРемонта > Зависимый.ДатаОкончанияРемонта Тогда
			ТекстСообщения = НСтр("es='¡La fecha del comienzo de la reparación es más grande que la fecha de la terminación!';ru='Дата начала ремонта больше даты окончания!';en='Repair start date is greater than the end date!'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
		КонецЕсли;
		
		Если Не Зависимый.Отвязать Тогда
			Если Зависимый.ДатаНачалаРемонта < ДатаНачалаРемонта Или Зависимый.ДатаНачалаРемонта > ДатаОкончанияРемонта Тогда
				ШаблонСообщения = НСтр("es='¡La fecha del comienzo de la reparación dependiente en la línea № %1 pasa de la raya del período de la reparación básica!';ru='Дата начала зависимого ремонта в строке №%1 выходит за пределы периода основного ремонта!';en='The start date of the dependent repair in line No.%1 goes beyond the period of the main repair!'");
				ТекстСообщения = СтрШаблон(ШаблонСообщения, Зависимый.НомерСтроки);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
			КонецЕсли;
			
			Если Зависимый.ДатаОкончанияРемонта < ДатаНачалаРемонта Или Зависимый.ДатаОкончанияРемонта > ДатаОкончанияРемонта Тогда
				ШаблонСообщения = НСтр("es='¡La fecha de la terminación de la reparación dependiente en la línea № %1 pasa de la raya del período de la reparación básica!';ru='Дата окончания зависимого ремонта в строке №%1  выходит за пределы периода основного ремонта!';en='The dependent repair end date in line №%1 is outside the main repair period!'");
				ТекстСообщения = СтрШаблон(ШаблонСообщения, Зависимый.НомерСтроки);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ШаблонСообщения = НСтр("es='Hay un documento no pasado la razón: %1';ru='Есть непроведенный документ основание: %1';en='There is an unsent document basis:%1'");
	
	Для Каждого СвязанныйРемонт Из СвязанныеРемонты Цикл
		Если Не СвязанныйРемонт.ДокументИсточник.Проведен Тогда
			ТекстСообщения = СтрШаблон(ШаблонСообщения, Строка(СвязанныйРемонт.ДокументИсточник));
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
			Возврат;
		КонецЕсли;
	КонецЦикла;	
	
	Если Не ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОснование, "Проведен") Тогда
		ТекстСообщения = СтрШаблон(ШаблонСообщения, Строка(ДокументОснование));
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
		Возврат;
	КонецЕсли;
	
	Если ВидОперации = Перечисления.торо_ВидыОперацийДокументаОстановочныйРемонт.Корректировка Тогда
		Если Не КорректируемыйДокумент.Проведен Тогда
			ТекстСообщения = НСтр("ru = 'Есть непроведенный документ основание: " + КорректируемыйДокумент + "'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
		КонецЕсли;
		
		Если Дата <= КорректируемыйДокумент.Дата Тогда
			ТекстСообщения = НСтр("es='¡La fecha de la corrección debe ser más de fechas corregido!';ru='Дата корректировки должна быть больше даты корректируемого!';en='The date of adjustment must be greater than the date of the adjusted!'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
		КонецЕсли;
	КонецЕсли;
	
	ШаблонСообщения = НСтр("es='La fecha del documento debe ser más de fechas del documento-fuente: ¡%1!';ru='Дата документа должна быть больше даты документа-источника: %1!';en='The document date must be greater than the date of the source document:%1!'");
		
	Для Каждого СвязанныйРемонт Из СвязанныеРемонты Цикл
		Если СвязанныйРемонт.ДокументИсточник.Дата >= Дата Тогда
			ТекстСообщения = СтрШаблон(ШаблонСообщения, Строка(СвязанныйРемонт.ДокументИсточник));
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
			Возврат;
		КонецЕсли;
	КонецЦикла;	
	
	Если Не Отказ Тогда
		ДвиженияПоРегистрам(Отказ);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает таблицу ремонтов с добавленным ремонтом из шапки документа.
Функция ПолучитьТаблицуРемонтовСОсновным() Экспорт
	
	ТаблицаРемонтовСОсновным = СвязанныеРемонты.Выгрузить();
	НС = ТаблицаРемонтовСОсновным.Добавить();
	НС.ID = IDОсновногоРемонта;
	НС.ОбъектРемонта = ОбъектРемонта;
	НС.ВидРемонта = ВидРемонта;
	НС.ДатаНачалаРемонта = ДатаНачалаРемонта;
	НС.ДатаОкончанияРемонта = ДатаОкончанияРемонта;
	НС.ДатаНачалаРемонтаСтарая = ДатаНачалаРемонтаСт;
	НС.ДатаОкончанияРемонтаСтарая = ДатаОкончанияРемонтаСт;
	НС.ДокументИсточник = ДокументОснование;
	
	Возврат ТаблицаРемонтовСОсновным;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьСуществованиеСледующихДокументов(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	торо_ОстановочныеРемонтыСвязанныеРемонты.ID КАК ИД
	               |ПОМЕСТИТЬ ИДДокумента
	               |ИЗ
	               |	Документ.торо_ОстановочныеРемонты.СвязанныеРемонты КАК торо_ОстановочныеРемонтыСвязанныеРемонты
	               |ГДЕ
	               |	торо_ОстановочныеРемонтыСвязанныеРемонты.Ссылка = &Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ ПЕРВЫЕ 1
	               |	торо_Ремонты.Регистратор КАК Регистратор
	               |ИЗ
	               |	РегистрСведений.торо_Ремонты КАК торо_Ремонты
	               |ГДЕ
	               |	торо_Ремонты.ID В
	               |			(ВЫБРАТЬ
	               |				Таб.ИД
	               |			ИЗ
	               |				ИДДокумента КАК Таб)
	               |	И торо_Ремонты.Период >= &ДатаДок
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	торо_Ремонты.Период";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ДатаДок", Дата);
	
	резЗапроса = Запрос.Выполнить();
	
	Если резЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Отказ = Истина;
	
	Выборка = резЗапроса.Выбрать();
	Выборка.Следующий();
	ШаблонСообщения = НСтр("es='¡Los datos de estas reparaciones son cambiados ya en el documento %1.!';ru='Данные этих ремонтов уже изменены в документе %1.!';en='The repair data has already been changed in document%1.!'");
	ТекстСообщения = СтрШаблон(ШаблонСообщения, Выборка.Регистратор);
	ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
	
КонецПроцедуры

Процедура ДвиженияПоРегистрам(Отказ)
	
	ТаблицаРемонтовСОсновным = ПолучитьТаблицуРемонтовСОсновным();
	
	ДвиженияПоРегистру_торо_ОстановочныеРемонты(Отказ, ТаблицаРемонтовСОсновным);
	ДвиженияПоРегистру_торо_ПлановыеРемонтныеРаботы(Отказ, ТаблицаРемонтовСОсновным);
	ДвиженияПоРегистру_торо_СоответствиеКорректировокДокументамППР();
	
	// Движения по регистру торо_ЗаявкиПоРемонтам больше не выполняются.
	
КонецПроцедуры

Процедура ДвиженияПоРегистру_торо_ОстановочныеРемонты(Отказ, ТабРемонтовСОсновным)
		
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СвязанныеРемонты.ID,
	|	СвязанныеРемонты.Отвязать,
	|	СвязанныеРемонты.ДатаНачалаРемонта,
	|  СвязанныеРемонты.ДатаОкончанияРемонта
	|ПОМЕСТИТЬ СвязанныеРемонты
	|ИЗ
	|	&СвязанныеРемонты КАК СвязанныеРемонты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабДоступность.ID,
	|	ТабДоступность.ДоступенДляРедактирования
	|ПОМЕСТИТЬ ТабДоступность
	|ИЗ
	|	&ТабДоступность КАК ТабДоступность
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	&IDОсновного КАК IDОсновного,
	|	торо_ОстановочныеРемонты.ID КАК IDЗависимого, 
	|	торо_ОстановочныеРемонты.Отвязать КАК Отвязан,
	|	торо_ОстановочныеРемонты.ДатаНачалаРемонта,
	|  торо_ОстановочныеРемонты.ДатаОкончанияРемонта
	|ИЗ
	|	СвязанныеРемонты КАК торо_ОстановочныеРемонты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТабДоступность КАК ТабДоступность
	|		ПО торо_ОстановочныеРемонты.ID = ТабДоступность.ID
	|ГДЕ
	|	ТабДоступность.ДоступенДляРедактирования";
	
	Запрос.УстановитьПараметр("СвязанныеРемонты", ТабРемонтовСОсновным);
	Запрос.УстановитьПараметр("IDОсновного",IDОсновногоРемонта);
	Запрос.УстановитьПараметр("ТабДоступность", Документы.торо_ОстановочныеРемонты.ОбновитьДоступностьДляРедактирования(Ссылка,ТабРемонтовСОсновным));
	
	ПланРемонтовДвижения = Запрос.Выполнить().Выгрузить();
		
	НаборЗаписей = РегистрыСведений.торо_ОстановочныеРемонты.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(Ссылка);
	НаборЗаписей.Прочитать();
	СтарыеДвижения = НаборЗаписей.Выгрузить();
	
	Движения.торо_ОстановочныеРемонты.Очистить();
	Движения.торо_ОстановочныеРемонты.Записывать = Истина;
	
	Если Не Отказ Тогда
		
		Для Каждого ИсходнаяСтрока Из СтарыеДвижения Цикл
			СтрДостДляРед = ПланРемонтовДвижения.НайтиСтроки(Новый Структура("IDЗависимого", ИсходнаяСтрока.IDЗависимого));
			СтрЕстьВДок = ТабРемонтовСОсновным.НайтиСтроки(Новый Структура("ID", ИсходнаяСтрока.IDЗависимого));
			Если СтрДостДляРед.Количество() = 0 И СтрЕстьВДок.Количество() > 0 Тогда
				Движение = Движения.торо_ОстановочныеРемонты.Добавить();
				ЗаполнитьЗначенияСвойств(Движение,ИсходнаяСтрока);
			КонецЕсли;
		КонецЦикла;
		
		Для каждого ИсходнаяСтрока Из ПланРемонтовДвижения Цикл
			Движение = Движения.торо_ОстановочныеРемонты.Добавить();
			ЗаполнитьЗначенияСвойств(Движение, ИсходнаяСтрока);
			Движение.Период = Дата;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ДвиженияПоРегистру_торо_ПлановыеРемонтныеРаботы(Отказ, ТаблицаРемонтовСОсновным)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	СвязанныеРемонты.ID КАК ID,
	               |	СвязанныеРемонты.ОбъектРемонта КАК ОбъектРемонта,
	               |	СвязанныеРемонты.ВидРемонта КАК ВидРемонта,
	               |	СвязанныеРемонты.ДатаНачалаРемонта КАК ДатаНачалаРемонта,
	               |	СвязанныеРемонты.ДатаОкончанияРемонта КАК ДатаОкончанияРемонта,
	               |	СвязанныеРемонты.ДатаНачалаРемонтаСтарая КАК ДатаНачалаРемонтаСтарая,
	               |	СвязанныеРемонты.ДатаОкончанияРемонтаСтарая КАК ДатаОкончанияРемонтаСтарая,
	               |	СвязанныеРемонты.Отвязать КАК Отвязать
	               |ПОМЕСТИТЬ СвязанныеРемонты
	               |ИЗ
	               |	&СвязанныеРемонты КАК СвязанныеРемонты
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ID,
	               |	ОбъектРемонта
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ТабДоступность.ID КАК ID,
	               |	ТабДоступность.ДоступенДляРедактирования КАК ДоступенДляРедактирования
	               |ПОМЕСТИТЬ ТабДоступность
	               |ИЗ
	               |	&ТабДоступность КАК ТабДоступность
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ID
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	торо_ПланГрафикРемонтаПланРемонтов.ID КАК ID,
	               |	торо_ПланГрафикРемонтаПланРемонтов.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
	               |	торо_ПланГрафикРемонтаПланРемонтов.Исполнитель КАК Исполнитель,
	               |	торо_ПланГрафикРемонтаПланРемонтов.ОбъектРемонтныхРабот КАК ОбъектРемонтныхРабот,
	               |	торо_ПланГрафикРемонтаПланРемонтов.СпособВыполнения КАК СпособВыполнения,
	               |	торо_ПланГрафикРемонтаПланРемонтов.Замещен КАК Замещен,
	               |	торо_ПланГрафикРемонтаПланРемонтов.ID_базы_расчета КАК ID_базы_расчета,
	               |	торо_ПланГрафикРемонтаПланРемонтов.ID_замещающего КАК ID_замещающего,
	               |	торо_ПланГрафикРемонтаПланРемонтов.СтоимостьРемонта КАК СтоимостьРемонта,
	               |	торо_ПланГрафикРемонтаПланРемонтов.Организация КАК Организация,
	               |	торо_ПланГрафикРемонтаПланРемонтов.ДатаНачалаРасчетная КАК ДатаНачалаРасчетная,
	               |	торо_ПланГрафикРемонтаПланРемонтов.Подразделение КАК Подразделение,
	               |	торо_ПланГрафикРемонтаПланРемонтов.ДатаНачалаРемонтныхРабот КАК ДатаНачалаРемонтныхРабот,
	               |	торо_ПланГрафикРемонтаПланРемонтов.ДатаОкончанияРемонтныхРабот КАК ДатаОкончанияРемонтныхРабот,
	               |	торо_ПланГрафикРемонтаПланРемонтов.Отменен КАК Отменен
	               |ПОМЕСТИТЬ ПланРемонтовОтвязанные
	               |ИЗ
	               |	РегистрСведений.торо_ПлановыеРемонтныеРаботы.СрезПоследних(
	               |			,
	               |			ID В
	               |					(ВЫБРАТЬ
	               |						СвязанныеРемонты.ID КАК ID
	               |					ИЗ
	               |						СвязанныеРемонты КАК СвязанныеРемонты
	               |					ГДЕ
	               |						СвязанныеРемонты.Отвязать = ИСТИНА)
	               |				И ТИПЗНАЧЕНИЯ(Регистратор) <> ТИП(Документ.торо_ОстановочныеРемонты)) КАК торо_ПланГрафикРемонтаПланРемонтов
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ID
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	торо_ПланГрафикРемонтаПланРемонтов.ID КАК ID,
	               |	торо_ПланГрафикРемонтаПланРемонтов.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
	               |	торо_ПланГрафикРемонтаПланРемонтов.Исполнитель КАК Исполнитель,
	               |	торо_ПланГрафикРемонтаПланРемонтов.ОбъектРемонтныхРабот КАК ОбъектРемонтныхРабот,
	               |	торо_ПланГрафикРемонтаПланРемонтов.СпособВыполнения КАК СпособВыполнения,
	               |	торо_ПланГрафикРемонтаПланРемонтов.Замещен КАК Замещен,
	               |	торо_ПланГрафикРемонтаПланРемонтов.ID_базы_расчета КАК ID_базы_расчета,
	               |	торо_ПланГрафикРемонтаПланРемонтов.ID_замещающего КАК ID_замещающего,
	               |	торо_ПланГрафикРемонтаПланРемонтов.СтоимостьРемонта КАК СтоимостьРемонта,
	               |	торо_ПланГрафикРемонтаПланРемонтов.Организация КАК Организация,
	               |	торо_ПланГрафикРемонтаПланРемонтов.ДатаНачалаРасчетная КАК ДатаНачалаРасчетная,
	               |	торо_ПланГрафикРемонтаПланРемонтов.Подразделение КАК Подразделение,
	               |	торо_ПланГрафикРемонтаПланРемонтов.Отменен КАК Отменен,
	               |	СвязанныеРемонты.ДатаНачалаРемонта КАК ДатаНачалаРемонтныхРабот,
	               |	СвязанныеРемонты.ДатаОкончанияРемонта КАК ДатаОкончанияРемонтныхРабот
	               |ПОМЕСТИТЬ ПланРемонтовНеОтвязанные
	               |ИЗ
	               |	СвязанныеРемонты КАК СвязанныеРемонты
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ПлановыеРемонтныеРаботы.СрезПоследних(
	               |				,
	               |				ID В
	               |					(ВЫБРАТЬ
	               |						СвязанныеРемонты.ID КАК ID
	               |					ИЗ
	               |						СвязанныеРемонты КАК СвязанныеРемонты
	               |					ГДЕ
	               |						СвязанныеРемонты.Отвязать = ЛОЖЬ)) КАК торо_ПланГрафикРемонтаПланРемонтов
	               |		ПО СвязанныеРемонты.ID = торо_ПланГрафикРемонтаПланРемонтов.ID
	               |			И СвязанныеРемонты.ОбъектРемонта = торо_ПланГрафикРемонтаПланРемонтов.ОбъектРемонтныхРабот
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ID
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПланРемонтовОтвязанные.ID КАК ID,
	               |	ПланРемонтовОтвязанные.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
	               |	ПланРемонтовОтвязанные.Исполнитель КАК Исполнитель,
	               |	ПланРемонтовОтвязанные.ОбъектРемонтныхРабот КАК ОбъектРемонтныхРабот,
	               |	ПланРемонтовОтвязанные.СпособВыполнения КАК СпособВыполнения,
	               |	ПланРемонтовОтвязанные.Замещен КАК Замещен,
	               |	ПланРемонтовОтвязанные.ID_базы_расчета КАК ID_базы_расчета,
	               |	ПланРемонтовОтвязанные.ID_замещающего КАК ID_замещающего,
	               |	ПланРемонтовОтвязанные.СтоимостьРемонта КАК СтоимостьРемонта,
	               |	ПланРемонтовОтвязанные.Организация КАК Организация,
	               |	ПланРемонтовОтвязанные.ДатаНачалаРасчетная КАК ДатаНачалаРасчетная,
	               |	ПланРемонтовОтвязанные.Подразделение КАК Подразделение,
	               |	ПланРемонтовОтвязанные.ДатаНачалаРемонтныхРабот КАК ДатаНачалаРемонтныхРабот,
	               |	ПланРемонтовОтвязанные.ДатаОкончанияРемонтныхРабот КАК ДатаОкончанияРемонтныхРабот,
	               |	ПланРемонтовОтвязанные.Отменен КАК Отменен
	               |ПОМЕСТИТЬ ПланРемонтов
	               |ИЗ
	               |	ПланРемонтовОтвязанные КАК ПланРемонтовОтвязанные
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ПланРемонтовНеОтвязанные.ID,
	               |	ПланРемонтовНеОтвязанные.ВидРемонтныхРабот,
	               |	ПланРемонтовНеОтвязанные.Исполнитель,
	               |	ПланРемонтовНеОтвязанные.ОбъектРемонтныхРабот,
	               |	ПланРемонтовНеОтвязанные.СпособВыполнения,
	               |	ПланРемонтовНеОтвязанные.Замещен,
	               |	ПланРемонтовНеОтвязанные.ID_базы_расчета,
	               |	ПланРемонтовНеОтвязанные.ID_замещающего,
	               |	ПланРемонтовНеОтвязанные.СтоимостьРемонта,
	               |	ПланРемонтовНеОтвязанные.Организация,
	               |	ПланРемонтовНеОтвязанные.ДатаНачалаРасчетная,
	               |	ПланРемонтовНеОтвязанные.Подразделение,
	               |	ПланРемонтовНеОтвязанные.ДатаНачалаРемонтныхРабот,
	               |	ПланРемонтовНеОтвязанные.ДатаОкончанияРемонтныхРабот,
	               |	ПланРемонтовНеОтвязанные.Отменен
	               |ИЗ
	               |	ПланРемонтовНеОтвязанные КАК ПланРемонтовНеОтвязанные
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ID
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	               |	торо_ПланГрафикРемонтаПланРемонтов.ID КАК ID,
	               |	торо_ПланГрафикРемонтаПланРемонтов.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
	               |	торо_ПланГрафикРемонтаПланРемонтов.ДатаНачалаРемонтныхРабот КАК ДатаНачалаРемонтныхРабот,
	               |	торо_ПланГрафикРемонтаПланРемонтов.ДатаОкончанияРемонтныхРабот КАК ДатаОкончанияРемонтныхРабот,
	               |	торо_ПланГрафикРемонтаПланРемонтов.Исполнитель КАК Исполнитель,
	               |	торо_ПланГрафикРемонтаПланРемонтов.ОбъектРемонтныхРабот КАК ОбъектРемонтныхРабот,
	               |	торо_ПланГрафикРемонтаПланРемонтов.СпособВыполнения КАК СпособВыполнения,
	               |	торо_ПланГрафикРемонтаПланРемонтов.Отменен КАК Отменен,
	               |	торо_ПланГрафикРемонтаПланРемонтов.Замещен КАК Замещен,
	               |	торо_ПланГрафикРемонтаПланРемонтов.ID_базы_расчета КАК ID_базы_расчета,
	               |	торо_ПланГрафикРемонтаПланРемонтов.ID_замещающего КАК ID_замещающего,
	               |	торо_ПланГрафикРемонтаПланРемонтов.СтоимостьРемонта КАК СтоимостьРемонта,
	               |	торо_ПланГрафикРемонтаПланРемонтов.Организация КАК Организация,
	               |	торо_ПланГрафикРемонтаПланРемонтов.ДатаНачалаРасчетная КАК ДатаНачалаРасчетная,
	               |	торо_ПланГрафикРемонтаПланРемонтов.Подразделение КАК Подразделение
	               |ИЗ
	               |	ПланРемонтов КАК торо_ПланГрафикРемонтаПланРемонтов
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТабДоступность КАК ТабДоступность
	               |		ПО торо_ПланГрафикРемонтаПланРемонтов.ID = ТабДоступность.ID
	               |ГДЕ
	               |	ТабДоступность.ДоступенДляРедактирования";
	
	Запрос.УстановитьПараметр("СвязанныеРемонты",ТаблицаРемонтовСОсновным);
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Запрос.УстановитьПараметр("ТабДоступность", Документы.торо_ОстановочныеРемонты.ОбновитьДоступностьДляРедактирования(Ссылка,ПолучитьТаблицуРемонтовСОсновным()));
	
	ПланРемонтовДвижения = Запрос.Выполнить().Выгрузить();
	ПланРемонтовДвижения.Индексы.Добавить("ID");
	
	Если ПланРемонтовДвижения.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	НаборЗаписей = РегистрыСведений.торо_ПлановыеРемонтныеРаботы.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(Ссылка);
	НаборЗаписей.Прочитать();
	СтарыеДвижения = НаборЗаписей.Выгрузить();
	
	Движения.торо_ПлановыеРемонтныеРаботы.Очистить();	
	
	Для Каждого ИсходнаяСтрока Из СтарыеДвижения Цикл
		СтрДостДляРед = ПланРемонтовДвижения.НайтиСтроки(Новый Структура("ID", ИсходнаяСтрока.ID));
		СтрЕстьВДок = ТаблицаРемонтовСОсновным.НайтиСтроки(Новый Структура("ID", ИсходнаяСтрока.ID));
		Если СтрДостДляРед.Количество() = 0 И СтрЕстьВДок.Количество() > 0 Тогда
			Движение = Движения.торо_ПлановыеРемонтныеРаботы.Добавить();
			ЗаполнитьЗначенияСвойств(Движение,ИсходнаяСтрока);
		КонецЕсли;
	КонецЦикла;
	
	Для каждого ИсходнаяСтрока Из ПланРемонтовДвижения Цикл
		Движение = Движения.торо_ПлановыеРемонтныеРаботы.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, ИсходнаяСтрока);
		Движение.Период = Дата;
	КонецЦикла;
	
	Движения.торо_ПлановыеРемонтныеРаботы.Записывать = Истина;
	
КонецПроцедуры

// Отражаем какие документы ППР, Заявки и Остановочные ремонты корректируем
Процедура ДвиженияПоРегистру_торо_СоответствиеКорректировокДокументамППР()
	
	МассивКорректируемых = Новый Массив;
	Для Каждого Строка Из СвязанныеРемонты Цикл
		Если МассивКорректируемых.Найти(Строка.ДокументИсточник) = Неопределено Тогда
			МассивКорректируемых.Добавить(Строка.ДокументИсточник);
		КонецЕсли;
	КонецЦикла;
	
	Если ВидОперации = Перечисления.торо_ВидыОперацийДокументаОстановочныйРемонт.Корректировка Тогда 
		НаборИсходных = ПолучитьКорректируемыеДокументы();
		Для Каждого ЗаписьИсходный Из НаборИсходных Цикл
			Если МассивКорректируемых.Найти(ЗаписьИсходный.Корректируемый) = Неопределено Тогда
				МассивКорректируемых.Добавить(ЗаписьИсходный.Корректируемый);
			КонецЕсли;
		КонецЦикла;
	Иначе
		Если МассивКорректируемых.Найти(ДокументОснование) = Неопределено Тогда
			МассивКорректируемых.Добавить(ДокументОснование);
		КонецЕсли;
	КонецЕсли;
	
	Для Каждого Корректируемый Из МассивКорректируемых Цикл
		Движение = Движения.торо_СоответствиеКорректировокДокументамППР.Добавить();
		Движение.Корректировка = Ссылка;
		Движение.Корректируемый = Корректируемый;
	КонецЦикла;
	
	Движения.торо_СоответствиеКорректировокДокументамППР.Записывать = Истина;
	
КонецПроцедуры

Функция ПолучитьКорректируемыеДокументы(ППР = Истина, Заявки = Истина, Остановочные = Истина)
	
	ТекстЗапроса = "ВЫБРАТЬ
	|	торо_СоответствиеКорректировокДокументамППР.Корректируемый
	|ИЗ
	|	РегистрСведений.торо_СоответствиеКорректировокДокументамППР КАК торо_СоответствиеКорректировокДокументамППР
	|ГДЕ
	|	торо_СоответствиеКорректировокДокументамППР.Корректировка = &Корректировка
	|	%Условие%";
	
	ТекстУсловия = "";
	
	Если Не (ППР И Заявки И Остановочные) Тогда
		Если ППР И Заявки Тогда
			ТекстУсловия = "И ТИПЗНАЧЕНИЯ(торо_СоответствиеКорректировокДокументамППР.Корректируемый) <> ТИП(Документ.торо_ОстановочныеРемонты)";
		ИначеЕсли ППР И Остановочные Тогда
			ТекстУсловия = "И ТИПЗНАЧЕНИЯ(торо_СоответствиеКорректировокДокументамППР.Корректируемый) <> ТИП(Документ.торо_ЗаявкаНаРемонт)";
		ИначеЕсли Заявки И Остановочные Тогда
			ТекстУсловия = "И ТИПЗНАЧЕНИЯ(торо_СоответствиеКорректировокДокументамППР.Корректируемый) <> ТИП(Документ.торо_ПланГрафикРемонта)";
		ИначеЕсли ППР Тогда
			ТекстУсловия = "И ТИПЗНАЧЕНИЯ(торо_СоответствиеКорректировокДокументамППР.Корректируемый) = ТИП(Документ.торо_ПланГрафикРемонта)";
		ИначеЕсли Заявки Тогда
			ТекстУсловия = "И ТИПЗНАЧЕНИЯ(торо_СоответствиеКорректировокДокументамППР.Корректируемый) = ТИП(Документ.торо_ЗаявкаНаРемонт)";
		ИначеЕсли Остановочные Тогда
			ТекстУсловия = "И ТИПЗНАЧЕНИЯ(торо_СоответствиеКорректировокДокументамППР.Корректируемый) = ТИП(Документ.торо_ОстановочныеРемонты)";
		КонецЕсли;
	КонецЕсли;
		
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%Условие%", ТекстУсловия);
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Корректировка",КорректируемыйДокумент);
	
	ТЗКорректируемых = Запрос.Выполнить().Выгрузить();
	Если Остановочные Тогда
		НС = ТЗКорректируемых.Добавить();
		НС.Корректируемый = КорректируемыйДокумент;
	КонецЕсли;
	
	Возврат ТЗКорректируемых;
	
КонецФункции

#КонецОбласти

#КонецЕсли
